tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
cask_args appdir: "/Applications"

brew "zsh"
brew "git"
brew "git-lfs"
brew "tig"
brew "awscli"
brew "aws-vault"
brew "tfenv"
brew "sops"
brew "ansible"
brew "kubectl"
brew "kubectx"
brew "kube-ps1"
brew "fzf"
brew "helm"
brew "helmfile"
brew "go"
brew "postgresql"
brew "jq"
brew "yq"

cask "iterm2"
cask "visual-studio-code"
cask "docker"
cask "google-chrome"
cask "google-cloud-sdk"
cask "parallels-client"