tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# personal repositories
tap "fujiwara/tap"
tap "TomoyukiSugiyama/homebrew-tap"
# shell
brew "zsh"
# git
brew "git"
brew "git-lfs"
brew "tig"
# aws
brew "awscli"
brew "aws-vault"
brew "fujiwara/tap/lambroll"
# infra
brew "tfenv"
brew "sops"
brew "ansible"
brew "asdf"
brew "rtx"
# kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "kube-ps1"
brew "fzf"
brew "krew"
brew "kwok"
brew "kubebuilder"
brew "helm"
brew "helmfile"
brew "skaffold"
brew "argocd"
brew "k6"
# application
brew "rustup-init"
brew "go"
# db
brew "postgresql@14"
brew "mysql-client"
# tools
brew "jq"
brew "yq"
brew "the_silver_searcher"
brew "watch"
brew "nkf"
brew "pigz"
# my brew
brew "tomoyukisugiyama/tap/cloud-sql-proxy-v2-operator"
brew "tomoyukisugiyama/tap/any-connect"
# cask
cask_args appdir: "/Applications"
cask "slack"
cask "discord"
cask "zoom"
cask "google-chrome"
cask "google-cloud-sdk"
cask "firefox"
cask "iterm2"
cask "visual-studio-code"
cask "docker"
cask "parallels-client"
cask "dbeaver-community"
cask "wireshark"
cask "anydesk"
cask "authy"

# vscode extentions
vscode "1YiB.rust-bundle"
vscode "atlassian.atlascode"
vscode "dustypomerleau.rust-syntax"
vscode "getgauge.gauge"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "yzhang.markdown-all-in-one"
